//=============================================================================
//
// 背景に動くBoxヘッダー
// Author:Yuda Kaito
//
//=============================================================================
#ifndef _BG_BOX_H_
#define _BG_BOX_H_

//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "motion.h"
#include "objectX.h"

//-----------------------------------------------------------------------------
// エネミークラス
//-----------------------------------------------------------------------------
class CBgBox : public CObjectX
{
public: // パブリック関数
	CBgBox();
	~CBgBox();

	HRESULT Init() override;		// 初期化
	void Uninit() override;			// 破棄
	void NormalUpdate() override;	// 更新
	void Draw() override;			// 描画

	static CBgBox* Create();	// 生成

private: // プライベート関数

private: // メンバー変数
};
#endif
