//=============================================================================
// 
// 色管理クラス
// Author YudaKaito
// 
//=============================================================================
//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "color.h"
#include "file.h"
#include "application.h"
#include "texture.h"

//-----------------------------------------------------------------------------
// 静的変数
//-----------------------------------------------------------------------------
static const nlohmann::json colorFile = LoadJson("data/FILE/color.json");

//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
CColor::CColor() :
	typeNumber(0)
{
}

//-----------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------
CColor::~CColor()
{
}

//-----------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------
HRESULT CColor::Init()
{
	SetTheme(0);
	typeNumber = colorFile["TYPE"].size();
	return S_OK;
}

//-----------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------
void CColor::Uninit()
{
}

//-----------------------------------------------------------------------------
// 色の取得
//-----------------------------------------------------------------------------
const D3DXCOLOR& CColor::GetColor(EColorConfig inConfig)
{
	// 指定されたKeyが存在するか否か
	if (m_color.count(inConfig) == 0)
	{ // Keyが設定されてなかった場合
		return D3DXCOLOR(0.0f, 0.0f, 0.0f, 1.0f);
	}

	/* ↓Keyが設定されていた場合↓ */

	return m_color[inConfig];
}

//-----------------------------------------------------------------------------
// テーマ色の決定
//-----------------------------------------------------------------------------
void CColor::SetTheme(int idx)
{
	// jsonのコンテナをD3DXCOLORに変換する
	auto VectorToD3DXCOLOR = [this](int inIndex, int inColor)
	{
		// 指定番号に値が存在しているか否か
		if ((int)colorFile["TYPE"].size() < inIndex || 0 > inIndex)
		{ // 指定番号に値が存在しない
			return D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
		}

		D3DXCOLOR color;

		color.r = colorFile["TYPE"].at(inIndex)["COLOR"].at(inColor).at(0);	// 赤色の設定
		color.g = colorFile["TYPE"].at(inIndex)["COLOR"].at(inColor).at(1);	// 緑色の設定
		color.b = colorFile["TYPE"].at(inIndex)["COLOR"].at(inColor).at(2);	// 青色の設定
		color.a = colorFile["TYPE"].at(inIndex)["COLOR"].at(inColor).at(3);	// 透明色の設定

		return color;
	};

	// 色の代入
	for (int i = 0; i < 4; i++)
	{
		if (m_color.count(i) != 0)
		{
			m_color[i] = VectorToD3DXCOLOR(idx, i);
		}
		else
		{
			m_color.insert(std::make_pair(i, VectorToD3DXCOLOR(idx, i)));
		}
	}
}
