//=============================================================================
//
// プレイヤー設定
// Author:Yuda Kaito
//
//=============================================================================
//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include <assert.h>
#include "enemy.h"
#include "application.h"
#include "color.h"
#include "sound.h"

//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
CEnemy::CEnemy()
{
}

//-----------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------
CEnemy::~CEnemy()
{
}

//-----------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------
HRESULT CEnemy::Init()
{
	LoadModel("BOX");

	// 現在のモーション番号の保管
	CObjectX::Init();
	SetType(CObject::ENEMY);
	SetMaterialDiffuse(0, CApplication::GetInstance()->GetColor()->GetColor(CColor::COLOR_3));

	AttachOutLine();
	AttachShadow();

	return S_OK;
}

//-----------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------
void CEnemy::Uninit()
{
	CObjectX::Uninit();
}

//-----------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------
void CEnemy::NormalUpdate()
{
}

//-----------------------------------------------------------------------------
// 終了更新
//-----------------------------------------------------------------------------
void CEnemy::EndUpdate()
{
	CApplication::GetInstance()->GetSound()->Play(CSound::LABEL_SE_ENEMY_HIT);
	Release();
}

//-----------------------------------------------------------------------------
// 生成
//-----------------------------------------------------------------------------
CEnemy* CEnemy::Create()
{
	CEnemy* enemy = new CEnemy;

	if (enemy != nullptr)
	{
		enemy->Init();
	}

	return enemy;
}

bool CEnemy::OnHitPlain()
{
	// 最初に見つけた指定したタイプのobjectを持ってくる
	CObject* object = SearchType(CObject::EType::PLAIN, CTaskGroup::EPriority::LEVEL_3D_1);

	while (object != nullptr)
	{
		CObject* next = object->NextSameType();	// 同じタイプのobjectを持ってくる

		if (OBBAndOBB((CObjectX*)object))
		{
			return true;
		}

		object = next;
	}
	return false;
}
