//=============================================================================
//
// プレイヤー設定
// Author:Yuda Kaito
//
//=============================================================================
#include <assert.h>
#include "goal.h"
#include "goal_effect.h"
#include "delay_process.h"

//-----------------------------------------------------------------------------
// コンストラクタ
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
CGoal::CGoal() :
	m_endCnt(0),
	m_isGoal(false)
{
}

//-----------------------------------------------------------------------------
// デストラクタ
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
CGoal::~CGoal()
{
}

//-----------------------------------------------------------------------------
// 初期化
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
HRESULT CGoal::Init()
{
	// 現在のモーション番号の保管
	LoadModel("BOX");
	CObjectX::Init();
	SetType(EType::GOAL);
	SetCollisionFlag(false);
	AttachShadow();
	return S_OK;
}

//-----------------------------------------------------------------------------
// 終了
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
void CGoal::Uninit()
{
	CObjectX::Uninit();
}

//-----------------------------------------------------------------------------
// 通常更新
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
void CGoal::NormalUpdate()
{
}

//-----------------------------------------------------------------------------
// 終了更新
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
void CGoal::EndUpdate()
{
	m_endCnt++;

	if (m_endCnt > 180)
	{
		Release();
	}
}

//-----------------------------------------------------------------------------
// 描画
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
void CGoal::Draw()
{
	CObjectX::Draw();
}

//-----------------------------------------------------------------------------
// 生成
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
CGoal* CGoal::Create()
{
	CGoal* goal = new CGoal;

	if (goal != nullptr)
	{
		goal->Init();
	}

	return goal;
}

//-----------------------------------------------------------------------------
// ゴール可能になる時間
// Author:Yuda Kaito
//-----------------------------------------------------------------------------
void CGoal::SetTime(int inTime)
{
	m_goalTime = inTime;

	CDelayProcess::DelayProcess(inTime, this, [this]()
	{
		SetMaterialDiffuse(0,D3DXCOLOR(1.0f,1.0f,0.0f,1.0f));
		SetCollisionFlag(true);

		auto effect = [this]()
		{
			for (int i = 0; i < 10; i++)
			{
				CGoalEffect::Create(GetPos());
			}
		};

		CDelayProcess::DelayProcess(3,this, effect,-1);
	});
}
