//=============================================================================
//
// モデルを潰す影
// Author:Yuda Kaito
//
//=============================================================================
#ifndef _CIRCLE_SHADOW_H_		//このマクロが定義されてなかったら
#define _CIRCLE_SHADOW_H_		//2重インクルード防止のマクロ定義

//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "objectX.h"

//-----------------------------------------------------------------------------
// 前方宣言
//-----------------------------------------------------------------------------
class CObjectX;

//-----------------------------------------------------------------------------
// モデルを潰す影
//-----------------------------------------------------------------------------
class CModelShadow : public CObjectX
{
public:
	CModelShadow();
	~CModelShadow();

	HRESULT Init() override;
	void Uninit() override;
	void Draw() override;
	void NormalUpdate() override;

	static CModelShadow* Create(CObjectX* inObject);

private:
	CObjectX* m_parent;
};
#endif